MISSING DATA

In [1]:
import numpy as np
import pandas as pd

In [11]:
a=pd.DataFrame({'A':[1,2,3,4,5,np.nan],
                'B':[6,7,np.nan,np.nan,6,np.nan],
                'C':[1,2,3,6,8,9]})

In [12]:
a

     A    B  C
0  1.0  6.0  1
1  2.0  7.0  2
2  3.0  NaN  3
3  4.0  NaN  6
4  5.0  6.0  8
5  NaN  NaN  9

In [4]:
a.dropna() #missing items will not print

     A    B  C
0  1.0  6.0  1
1  2.0  7.0  2
4  5.0  6.0  8

In [14]:
a.dropna(axis=1)

     A    B  C
0  1.0  6.0  1
1  2.0  7.0  2
2  3.0  NaN  3
3  4.0  NaN  6
4  5.0  6.0  8
5  NaN  NaN  9

In [15]:
a.dropna(thresh=2)

     A    B  C
0  1.0  6.0  1
1  2.0  7.0  2
2  3.0  NaN  3
3  4.0  NaN  6
4  5.0  6.0  8

In [17]:
a

     A    B  C
0  1.0  6.0  1
1  2.0  7.0  2
2  3.0  NaN  3
3  4.0  NaN  6
4  5.0  6.0  8
5  NaN  NaN  9

In [16]:
a.fillna(value='FILL VALUE')

            A           B  C
0         1.0         6.0  1
1         2.0         7.0  2
2         3.0  FILL VALUE  3
3         4.0  FILL VALUE  6
4         5.0         6.0  8
5  FILL VALUE  FILL VALUE  9

In [16]:
a['A'].fillna(value=a['A'].mean())

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    3.0
Name: A, dtype: float64

In [22]:
a['B'].fillna(value=a['B'].mean())

0    6.000000
1    7.000000
2    6.333333
3    6.333333
4    6.000000
5    6.333333
Name: B, dtype: float64

GROUPBY

In [115]:
a= {'subject':['ENG','ENG','GK','GK','MALAYALAM','SS'],
    'STUDENTS':['Sam','Charlie','Amy','Vanessa','anu','manu'],
    'MARK':[20,12,34,18,25,35]}

In [116]:
a=pd.DataFrame(a)

In [100]:
a

     subject STUDENTS  MARK
0        ENG      Sam    20
1        ENG  Charlie    12
2         GK      Amy    34
3         GK  Vanessa    18
4  MALAYALAM      anu    25
5         SS     manu    35

In [101]:
a.groupby('subject')

In [102]:
s=a.groupby('subject')

In [103]:
s

In [104]:
s.sum(numeric_only=True)

           MARK
subject
ENG          32
GK           52
MALAYALAM    25
SS           35

In [105]:
a.groupby('subject').mean(numeric_only=True)

           MARK
subject
ENG        16.0
GK         26.0
MALAYALAM  25.0
SS         35.0

In [118]:
s.std(numeric_only=True)

                MARK
subject
ENG         5.656854
GK         11.313708
MALAYALAM        NaN
SS               NaN

In [119]:
s.min(numeric_only=True)

           MARK
subject
ENG          12
GK           18
MALAYALAM    25
SS           35

In [126]:
s.max(numeric_only=True)

           MARK
subject
ENG          20
GK           34
MALAYALAM    25
SS           35

In [125]:
s.count()

           STUDENTS  MARK
subject
ENG               2     2
GK                2     2
MALAYALAM         1     1
SS                1     1

In [120]:
s.describe()

           MARK
          count  mean        std   min   25%   50%   75%   max
subject
ENG         2.0  16.0   5.656854  12.0  14.0  16.0  18.0  20.0
GK          2.0  26.0  11.313708  18.0  22.0  26.0  30.0  34.0
MALAYALAM   1.0  25.0        NaN  25.0  25.0  25.0  25.0  25.0
SS          1.0  35.0        NaN  35.0  35.0  35.0  35.0  35.0

In [121]:
s.describe().transpose()

subject           ENG         GK  MALAYALAM    SS
MARK count   2.000000   2.000000        1.0   1.0
     mean   16.000000  26.000000       25.0  35.0
     std     5.656854  11.313708        NaN   NaN
     min    12.000000  18.000000       25.0  35.0
     25%    14.000000  22.000000       25.0  35.0
     50%    16.000000  26.000000       25.0  35.0
     75%    18.000000  30.000000       25.0  35.0
     max    20.000000  34.000000       25.0  35.0

In [124]:
s.describe().transpose()['GK']

MARK  count     2.000000
      mean     26.000000
      std      11.313708
      min      18.000000
      25%      22.000000
      50%      26.000000
      75%      30.000000
      max      34.000000
Name: GK, dtype: float64